config.org
#+TITLE: Emacs Configuration
#+AUTHOR: codingquark
#+STARTUP: overview

* Package Management

First, we need to set up package management with MELPA Stable and ensure use-package is available.

#+BEGIN_SRC emacs-lisp
(require 'package)
(add-to-list 'package-archives '("melpa-stable" . "https://stable.melpa.org/packages/") t)
(package-initialize)

;; Bootstrap use-package
(unless (package-installed-p 'use-package)
  (package-refresh-contents)
  (package-install 'use-package))

(require 'use-package)
(setq use-package-always-ensure t)
#+END_SRC

* UI Configuration

Clean up the interface by removing unnecessary UI elements and configuring the startup behavior.

#+BEGIN_SRC emacs-lisp
  (use-package emacs
    :init
    ;; Remove UI clutter
    (menu-bar-mode -1)
    (tool-bar-mode -1)
    (scroll-bar-mode -1)
    
    ;; Startup configuration
    (setq inhibit-startup-message t)
    (setq initial-major-mode 'org-mode)
    (setq initial-scratch-message "")
    
    ;; Start in denote directory
    ;; (setq initial-buffer-choice (lambda () (dired "~/Documents/notes")))
    )
#+END_SRC

* Theme

Load the Modus Vivendi theme for a clean dark interface.

#+BEGIN_SRC emacs-lisp
(use-package modus-themes
  :init
  (load-theme 'modus-operandi t))
#+END_SRC

* Font Configuration

Configure the core font faces: keep code and tabular buffers on IBM Plex Mono,
and use Charter for variable-pitch reading buffers such as `shr` renderers.

#+BEGIN_SRC emacs-lisp
(defconst cq-variable-pitch-font "Charter"
  "Font family used by variable-pitch faces.")

(when (find-font (font-spec :family cq-variable-pitch-font))
  ;; Reading-oriented modes like elfeed-show rely on `variable-pitch`.
  (set-face-attribute 'variable-pitch nil :family cq-variable-pitch-font))

(when (or (string= system-name "muon.local") (string= system-name "photon"))
  (set-face-attribute 'default nil :font "IBM Plex Mono" :height 160))
#+END_SRC

* Editor Settings

Configure basic editor behavior including indentation, backups, and visual aids.

#+BEGIN_SRC emacs-lisp
(use-package emacs
  :init
  ;; Indentation
  (setq-default indent-tabs-mode nil)
  (setq-default tab-width 2)
  
  ;; File management
  (setq backup-directory-alist '(("." . "~/.config/emacs/backups")))
  (setq auto-save-file-name-transforms '((".*" "~/.config/emacs/auto-save-list/" t)))
  
  ;; Visual aids
  (global-display-line-numbers-mode 1)
  (show-paren-mode 1)
  ;; macOS compatibility
  (setq dired-use-ls-dired nil)

  :hook ((dired-mode . auto-revert-mode)
         (prog-mode . auto-revert-mode)
         (text-mode . auto-revert-mode))

  ;; Better keybindings
  :bind
  ("C-x C-b" . ibuffer))
#+END_SRC

* Completion

Set up a modern minibuffer completion stack for navigation, search, and actions.

#+BEGIN_SRC emacs-lisp
(use-package vertico
  :init
  (vertico-mode 1)
  :bind (:map vertico-map
              ("RET" . vertico-directory-enter)
              ("DEL" . vertico-directory-delete-char)
              ("M-DEL" . vertico-directory-delete-word))
  :hook (rfn-eshadow-update-overlay . vertico-directory-tidy))

(use-package orderless
  :custom
  (completion-styles '(orderless basic))
  (completion-category-defaults nil)
  (completion-category-overrides '((file (styles partial-completion)))))

(use-package marginalia
  :init
  (marginalia-mode 1))

(use-package consult
  :bind (("C-s" . consult-line)
         ("C-x b" . consult-buffer)
         ("C-x 4 b" . consult-buffer-other-window)
         ("M-y" . consult-yank-pop)
         ("M-g g" . consult-goto-line)
         ("M-g i" . consult-imenu)
         ("M-s g" . consult-grep)
         ("M-s r" . consult-ripgrep)))

(use-package embark
  :bind (("C-." . embark-act)
         ("C-;" . embark-dwim)
         ("C-h B" . embark-bindings))
  :init
  (setq prefix-help-command #'embark-prefix-help-command))

(use-package embark-consult
  :after (embark consult)
  :hook (embark-collect-mode . consult-preview-at-point-mode))
#+END_SRC

* Help

Improve keybinding discovery and help buffers.

#+BEGIN_SRC emacs-lisp
(use-package which-key
  :init
  (which-key-mode 1)
  :custom
  (which-key-idle-delay 0.5))

(use-package helpful
  :bind (([remap describe-command] . helpful-command)
         ([remap describe-function] . helpful-callable)
         ([remap describe-key] . helpful-key)
         ([remap describe-symbol] . helpful-symbol)
         ([remap describe-variable] . helpful-variable)))
#+END_SRC

* Session

Persist useful session state across restarts and make window layouts undoable.

#+BEGIN_SRC emacs-lisp
(use-package savehist
  :ensure nil
  :init
  (savehist-mode 1))

(use-package recentf
  :ensure nil
  :init
  (recentf-mode 1)
  :custom
  (recentf-max-saved-items 200))

(use-package saveplace
  :ensure nil
  :init
  (save-place-mode 1))

(use-package winner
  :ensure nil
  :init
  (winner-mode 1))
#+END_SRC

* Reading

Set up Elfeed for RSS reading and keep the feed list in a separate file.

#+BEGIN_SRC emacs-lisp
(defvar cq-elfeed-feeds-file
  (expand-file-name "elfeed-feeds.el" user-emacs-directory)
  "Path to the personal Elfeed feed list.")

(use-package elfeed
  :bind (("C-c f" . elfeed)
         ("C-c F" . cq-open-elfeed-feeds-file))
  :custom
  (elfeed-db-directory (expand-file-name "elfeed" user-emacs-directory))
  (elfeed-search-filter "@2-months-ago +unread")
  :config
  ;; Keep subscriptions outside the main config to make feed edits low-friction.
  (load cq-elfeed-feeds-file 'noerror 'nomessage)

  (defun cq-open-elfeed-feeds-file ()
    "Open the Elfeed subscriptions file."
    (interactive)
    (find-file cq-elfeed-feeds-file)))
#+END_SRC

* Dired Configuration

Configure dired with denote integration.

#+BEGIN_SRC emacs-lisp
(use-package dired
  :ensure nil
  :hook ((dired-mode . denote-dired-mode)
         (dired-mode . dired-hide-details-mode)))
#+END_SRC

* Git

Set up Magit for repository status and everyday Git workflows.

#+BEGIN_SRC emacs-lisp
(use-package magit
  :bind (("C-x g" . magit-status)))
#+END_SRC

* Note Taking

Configure Denote for simple note-taking and knowledge management.

#+BEGIN_SRC emacs-lisp
(use-package denote
  :hook (text-mode . denote-fontify-links-mode)
  :bind (
    ("C-c n n" . denote)
    ("C-c n D" . cq-open-denote-directory)
    ("C-c n N" . denote-type)
    ("C-c n i" . denote-link)
    ("C-c n I" . denote-add-links)
    ("C-c n b" . denote-backlinks)
    ("C-c n f b" . denote-find-backlink)
    ("C-c n r" . denote-rename-file)
    ("C-c n R" . denote-rename-file-using-front-matter)
    ;; ("C-c n ." . cq-insert-time-stamp)
    )
  :custom
  (denote-directory "~/Documents/notes")
  (denote-infer-keywords t)
  (denote-sort-keywords t)
  (denote-file-type 'text)
  (denote-prompts '(title keywords))
  :config
  (setq crm-separator ",")
  (defun cq-open-denote-directory ()
    (interactive)
    (revert-buffer (dired denote-directory)))
  (defun cq-insert-time-stamp ()
    "Insert a timestamp with a newline character."
    (interactive)
    (insert (current-time-string))
    (newline)))

(use-package denote-journal
  :after denote
  :bind
  (("C-c n j" . denote-journal-new-or-existing-entry))
  :custom
  (denote-journal-title-format 'day-date-month-year))

(use-package denote-menu
  :after denote)
#+END_SRC

* Writing

** Olivetti Mode

Configure olivetti for distraction-free writing with centered text.

#+BEGIN_SRC emacs-lisp
  (use-package olivetti
    :hook ((org-mode . olivetti-mode))
    :config
    (setq olivetti-body-width 80))
#+END_SRC

** Markdown

Configure markdown-mode for editing markdown files.

#+BEGIN_SRC emacs-lisp
  (use-package markdown-mode
    :mode (("README\\.md\\'" . gfm-mode)
           ("\\.md\\'" . markdown-mode)
           ("\\.markdown\\'" . markdown-mode)))

#+END_SRC
